Конфигурация/Catalogs/ДепозитарныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДепозитарныеСчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненныеРазделы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попекаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПопечения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ТипыДепозитарныхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыДепозитарныхСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозитарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазделДепозитарногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицевой</Name>
					<Comment>Такие счета используются для ведения реестров ЦБ у регистраторов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ДепозитарныеСчета/Ext/ManagerModule.bsl
Функция СформироватьНаименование(РеквизитыСчета, ЗадействованныеРеквизиты = "") Экспорт
	
	ЗадействованныеРеквизиты = "Родитель, Договор, Депозитарий, НомерСчета, ТипСчета, ВидСчета, Попекаемый, Брокер";
	
	Если РеквизитыСчета = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Наименование = "";
	
	Если      РеквизитыСчета.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.Собственный Тогда
		
		Если ЗначениеЗаполнено(РеквизитыСчета.Депозитарий) И ЗначениеЗаполнено(РеквизитыСчета.Договор) Тогда
			Наименование = "" + РеквизитыСчета.Депозитарий + ", Собств. по договору № " + РеквизитыСчета.Договор.НомерДоговора + " от " + Формат(РеквизитыСчета.Договор.ДатаЗаключения, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	ИначеЕсли РеквизитыСчета.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.ОтветственноеХранение Тогда
		
		Если ЗначениеЗаполнено(РеквизитыСчета.Депозитарий) И ЗначениеЗаполнено(РеквизитыСчета.Договор) Тогда
			Наименование = "" + РеквизитыСчета.Депозитарий + ", Отв. хран. по договору № " + РеквизитыСчета.Договор.НомерДоговора + " от " + Формат(РеквизитыСчета.Договор.ДатаЗаключения, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
	ИначеЕсли РеквизитыСчета.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.Депозитарный Тогда
		
		Если ЗначениеЗаполнено(РеквизитыСчета.Депозитарий) И ЗначениеЗаполнено(РеквизитыСчета.НомерСчета)
			И ЗначениеЗаполнено(РеквизитыСчета.ВидСчета)
		Тогда
			Наименование = "" + РеквизитыСчета.Депозитарий + ", " + РеквизитыСчета.ВидСчета + ", " + РеквизитыСчета.НомерСчета + ?(РеквизитыСчета.Попекаемый, " (попек.)", "");
		КонецЕсли;
		
	ИначеЕсли РеквизитыСчета.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.РазделДепозитарногоСчета Тогда
		Если ЗначениеЗаполнено(РеквизитыСчета.Родитель) И ЗначениеЗаполнено(РеквизитыСчета.НомерСчета) Тогда
			Если      Лев(РеквизитыСчета.НомерСчета, 2) = "31" Тогда
				Наименование = "Торговый в НРД";
			ИначеЕсли Лев(РеквизитыСчета.НомерСчета, 2) = "36" Тогда
				Наименование = "Торговый+ в НРД";
			ИначеЕсли Лев(РеквизитыСчета.НомерСчета, 2) = "38" Тогда
				Наименование = "Блокиров. в НРД";
			Иначе
				Наименование = "";
			КонецЕсли;
			
			ОрганизацияРЭМ = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ");
			ДобавлятьНомерРаздела = ЗначениеЗаполнено(РеквизитыСчета.Организация) И РеквизитыСчета.Организация = ОрганизацияРЭМ;
			
			Наименование = РеквизитыСчета.Родитель.НомерСчета
				+ ?(ДобавлятьНомерРаздела, ", " + РеквизитыСчета.НомерСчета, "")
				+ ", " + ?(Наименование <> "", Наименование + ", ", "")
				+ ?(ЗначениеЗаполнено(РеквизитыСчета.Брокер), РеквизитыСчета.Брокер, "");
		КонецЕсли;
		
	ИначеЕсли РеквизитыСчета.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.Лицевой Тогда
		
		Если ЗначениеЗаполнено(РеквизитыСчета.Депозитарий) Тогда
			Если ЗначениеЗаполнено(РеквизитыСчета.Договор) Тогда
				Наименование = "" + РеквизитыСчета.Депозитарий + ", Лицевой счет по договору № " + РеквизитыСчета.Договор.НомерДоговора + " от " + Формат(РеквизитыСчета.Договор.ДатаЗаключения, "ДФ=dd.MM.yyyy");
			Иначе
				Наименование = "" + РеквизитыСчета.Депозитарий + ", Лицевой счет № " + РеквизитыСчета.НомерСчета;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименование



Функция ЕстьПодчиненныеРазделы(Родитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДепозитарныеСчета.Ссылка
		|ИЗ
		|	Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
		|ГДЕ
		|	ДепозитарныеСчета.Родитель = &Родитель";

	Запрос.УстановитьПараметр("Родитель", Родитель);

	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ЕстьПодчиненныеРазделы

Функция ПолучитьСвязанныеРеквизитыСчетаИРаздела() Экспорт
	
	СвязанныеРеквизиты = Новый Массив();
	СвязанныеРеквизиты.Добавить("Организация");
	СвязанныеРеквизиты.Добавить("Договор");
	СвязанныеРеквизиты.Добавить("Депозитарий");
	СвязанныеРеквизиты.Добавить("Попекаемый");
	СвязанныеРеквизиты.Добавить("Попечитель");
	СвязанныеРеквизиты.Добавить("ДоговорПопечения");

	Возврат СвязанныеРеквизиты;
	
КонецФункции // ПолучитьСвязанныеРеквизитыСчетаИРаздела

////////////////////////////////////////////////////////////////////////////////

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" И Не Параметры.Свойство("Ключ") И Не Параметры.Свойство("ЗначениеКопирования") Тогда
		
		// Для лицевых счетов мастер не используется
		Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
			Если Параметры.ЗначенияЗаполнения.Свойство("ТипСчета") и Параметры.ЗначенияЗаполнения.ТипСчета = Перечисления.ТипыДепозитарныхСчетов.Лицевой Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Справочники.ДепозитарныеСчета.Формы.МастерСозданияНового;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольВладельцаСчетаДепо(ДепозитарныйСчет, Организация, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДепозитарныйСчет) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДепозитарныйСчет.ВладелецСчета <> Организация.ЮрФизЛицо И Не (ДепозитарныйСчет = Справочники.ДепозитарныеСчета.СчетУчетаДеривативов Или ДепозитарныйСчет = Справочники.ДепозитарныеСчета.СчетУчетаДолей) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Юр.лицо организации «" + Организация.ЮрФизЛицо + "» не равно владельцу «" + ДепозитарныйСчет.ВладелецСчета
			+ "» выбранному в счете депо «" + ДепозитарныйСчет + "»",,,, Отказ);
	КонецЕсли;	
	
КонецПроцедуры
